In [1]:
import pandas as pd

In [13]:
df = pd.read_csv("taxi_data_final.csv", header=0, delimiter=",")

In [14]:
df

          secs  miles  pickup  dropoff  hour  month  day wday  company_id
0         1260    0.6      77       28     0      1    1  Tue           0
1         1500    0.7      76        2     0      1    1  Tue           0
2         1140    0.7      76       16     0      1    1  Tue           0
3         1920    1.7      76       56     0      1    1  Tue           0
4         2580    0.9       8       56     1      1    1  Tue           0
...        ...    ...     ...      ...   ...    ...  ...  ...         ...
11398001   240    0.8      39       38    11     12   31  Tue          54
11398002  1080    3.5      33        8    12     12   31  Tue          54
11398003  1020    3.1       8       33    12     12   31  Tue          54
11398004   840    5.8      33       41    13     12   31  Tue          54
11398005  1860    4.0      35       35    16     12   31  Tue          54

[11398006 rows x 9 columns]

In [5]:
cols = df.columns.values.tolist()
cols

['secs', 'miles', 'pickup', 'dropoff', 'hour', 'mday', 'company_id']

In [15]:
unique_values = df['month'].unique()
unique_values

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12], dtype=int64)

In [16]:
for x in unique_values:
    df_month = df[df['month'] == x]
    file_name = f"month{x}.tsv"
    df_month.to_csv(file_name, index=False, header=True, mode='a')

In [17]:
unique_values = df['company_id'].unique()
unique_values

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33,
       34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50,
       51, 52, 53, 54], dtype=int64)

In [18]:
for x in unique_values:
    df_comp = df[df['company_id'] == x]
    file_name = f"company{x}.tsv"
    df_comp.to_csv(file_name, index=False, header=True, mode='a')

In [19]:
unique_values = df['pickup'].unique()
unique_values

array([77, 76,  8, 56,  6, 32, 33, 28,  7, 71, 62, 45, 43, 24, 22, 17,  3,
       21, 10, 14, 41,  2, 42, 69, 59, 16, 15, 58, 44,  5, 12, 40, 46, 34,
       11,  4,  1, 68, 19, 73, 70, 13, 53, 60, 65,  9, 67, 54, 29, 23, 38,
       27, 36, 50, 64, 51, 26, 25, 49, 66, 31, 35, 20, 57, 61, 75, 39, 30,
       37, 47, 48, 72, 55, 63, 18, 52, 74], dtype=int64)

In [20]:
for x in unique_values:
    df_area = df[df['pickup'] == x]
    file_name = f"pickuparea{x}.tsv"
    df_area.to_csv(file_name, index=False, header=True, mode='a')

In [21]:
unique_values = df['dropoff'].unique()
unique_values

array([28,  2, 16, 56, 10, 77, 33,  5, 14, 44,  3, 32, 76,  8, 63, 21, 22,
        6,  4, 41, 23,  7, 24, 39, 31, 45, 72, 35, 42, 43, 60, 12,  1, 49,
       64, 69, 61, 19, 40, 65, 30,  9, 15, 27, 25, 34, 70, 13, 66, 29, 59,
       18, 11, 71, 75, 68, 17, 38, 20, 67, 57, 62, 73, 51, 36, 53, 46, 47,
       58, 50, 74, 48, 37, 26, 54, 52, 55], dtype=int64)

In [22]:
for x in unique_values:
    df_area = df[df['dropoff'] == x]
    file_name = f"dropoffarea{x}.tsv"
    df_area.to_csv(file_name, index=False, header=True, mode='a')

In [12]:
df = pd.read_table("onlyDates.csv", header=0, delimiter=",")

In [13]:
df

                date  month
0         2019-01-01      1
1         2019-01-01      1
2         2019-01-01      1
3         2019-01-01      1
4         2019-01-01      1
...              ...    ...
11398001  2019-12-31     12
11398002  2019-12-31     12
11398003  2019-12-31     12
11398004  2019-12-31     12
11398005  2019-12-31     12

[11398006 rows x 2 columns]

In [15]:
unique_values = df['month'].unique()
unique_values

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12], dtype=int64)

In [25]:
for x in unique_values:
    df_ = df[df['month'] == x]
    file_name = f"onlyDates{x}.csv"
    df_.to_csv(file_name, index=False, header=True, mode='a')

In [45]:
# df_ = df[df['month'] == 1]
# df_
# df
df_dates_count = df.groupby(['date'])['date'].count()
df_dates_count

date
2019-01-01    19110
2019-01-02    24055
2019-01-03    28028
2019-01-04    29721
2019-01-05    19212
              ...
2019-12-27    20604
2019-12-28    17424
2019-12-29    14278
2019-12-30    20878
2019-12-31    20018
Name: date, Length: 365, dtype: int64

In [48]:
# df_dates_count = pd.DataFrame(df_dates_count)
# df_dates_count.columns = ["count"]
df_dates_count = df_dates_count.reset_index()
df_dates_count

           date  count
0    2019-01-01  19110
1    2019-01-02  24055
2    2019-01-03  28028
3    2019-01-04  29721
4    2019-01-05  19212
..          ...    ...
360  2019-12-27  20604
361  2019-12-28  17424
362  2019-12-29  14278
363  2019-12-30  20878
364  2019-12-31  20018

[365 rows x 2 columns]

In [55]:
dateCount.to_csv("DATES.csv", index=False, header=True, mode='a')

In [54]:
dateCount = df_dates_count
dateCount

           date  count
0    2019-01-01  19110
1    2019-01-02  24055
2    2019-01-03  28028
3    2019-01-04  29721
4    2019-01-05  19212
..          ...    ...
360  2019-12-27  20604
361  2019-12-28  17424
362  2019-12-29  14278
363  2019-12-30  20878
364  2019-12-31  20018

[365 rows x 2 columns]

In [57]:
df = pd.read_table("onlyDays.tsv", header=0, delimiter="\t")
df

         wday  month
0         Tue      1
1         Tue      1
2         Tue      1
3         Tue      1
4         Tue      1
...       ...    ...
11398001  Tue     12
11398002  Tue     12
11398003  Tue     12
11398004  Tue     12
11398005  Tue     12

[11398006 rows x 2 columns]

In [71]:
day_count = df.groupby(['wday'])['wday'].count()
day_count

wday
Fri    1915833
Mon    1583114
Sat    1261132
Sun    1059737
Thu    1939243
Tue    1802296
Wed    1836651
Name: wday, dtype: int64

In [73]:
# daycount = pd.DataFrame(day_count)
# daycount.columns = ["count"]
daycount = daycount.reset_index()
daycount

  wday    count
0  Fri  1915833
1  Mon  1583114
2  Sat  1261132
3  Sun  1059737
4  Thu  1939243
5  Tue  1802296
6  Wed  1836651

In [74]:
daycount.to_csv("WDAY.csv", index=False, header=True, mode='a')

In [82]:
# df = pd.read_table("onlyHours.tsv", header=0, delimiter="\t")
# df
# m_count = df.groupby(['hour'])['hour'].count()
# m_count
# mcount = pd.DataFrame(m_count)
# mcount.columns = ["count"]
# mcount = mcount.reset_index()
# mcount
# mcount.to_csv("HOURS.csv", index=False, header=True, mode='a')

    hour   count
0      0  247076
1      1  192008
2      2  147402
3      3  112595
4      4   87146
5      5   91697
6      6  159737
7      7  340740
8      8  533624
9      9  572724
10    10  548393
11    11  622767
12    12  678618
13    13  687688
14    14  675634
15    15  705022
16    16  779237
17    17  848510
18    18  817358
19    19  709997
20    20  575188
21    21  499398
22    22  434486
23    23  330961

In [112]:
# df = pd.read_table("onlyMonths.tsv", header=0, delimiter="\t")
# df
# m_count = df.groupby(['month'])['month'].count()
# m_count
# mcount = pd.DataFrame(m_count)
# mcount.columns = ["count"]
# mcount = mcount.reset_index()
# mcount
# mcount.to_csv("MONTHS.csv", index=False, header=True, mode='a')

FileNotFoundError: [Errno 2] No such file or directory: 'onlyMonths.tsv'

In [118]:
# df = pd.read_table("onlySecs.tsv", header=0, delimiter="\t")
# df
# unique_values = df['month'].unique()
# unique_values
# df_ = df[df['month'] == 1]
# df_ = df_["miles"]
# df_ = pd.DataFrame(df_)
# df_
for x in unique_values:
    df_ = df[df['month'] == x]
    df_ = df_["secs"]
    df_ = pd.DataFrame(df_)
    file_name = f"SECS{x}.csv"
    df_.to_csv(file_name, index=False, header=True, mode='a')

In [117]:
df

          secs  month
0         1260      1
1         1500      1
2         1140      1
3         1920      1
4         2580      1
...        ...    ...
11398001   240     12
11398002  1080     12
11398003  1020     12
11398004   840     12
11398005  1860     12

[11398006 rows x 2 columns]